#pragma once

#define ROWS_DEF 20
#define COLUMNS_DEF 10

class boardCl //класс нашего борда для игры
{
protected:
	int board[ROWS_DEF][COLUMNS_DEF];

private:

public:
	
	boardCl (); //конструктор

	~boardCl(){}; //деструктор

	bool compareBoards(boardCl *boardShape); //сравнение с бордом формы
	
	bool checkFalling(int iter); //ждем пока фигурка упадет

	int changeBoard(boardCl *boardShape); //изменение борда
	
	void cleanBoard(); //очистка борда

	boardCl operator = (boardCl *right)
	{
		for (int i = 0; i < ROWS_DEF; i++)
			for (int j = 0; j < COLUMNS_DEF; j++)
				this->board[i][j] = right->board[i][j];
	}


};

/*
				Пример начального борда
		 0   1   2   3   4   5   6   7   8   9
	0	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	1	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	2	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	3	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	4	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	5	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	6	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	7	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	8	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	9	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	10	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	11	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	12	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	13	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0}
	14	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	15	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	16	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	17	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	18	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0},
	19	{0},{0},{0},{0},{0},{0},{0},{0},{0},{0}  
*/